Revit 2027 API
ModelPathUtils Properties
The ModelPathUtils type exposes the following members.
Properties
Name | Description
CloudRegionEMEA | Obsolete.
 The name of cloud region EMEA. This method is deprecated in Revit 2026.3 and may be removed in a later version of Revit. See GetAllCloudRegions to get the list of all available regions.
CloudRegionUS | Obsolete.
 The name of cloud region US. This method is deprecated in Revit 2026.3 and may be removed in a later version of Revit. See GetAllCloudRegions to get the list of all available regions.
Top
See Also
Reference
ModelPathUtils Class
Autodesk.Revit.DB Namespace